IRP/src/Catalogs/Agreements/Agreements.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Agreements</name>
 <attributes>
  <name>Number</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>30</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Date</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>PartnerSegment</name>
  <type>
   <types>CatalogRef.PartnerSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>PriceType</name>
  <type>
   <types>CatalogRef.PriceTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>ItemSegment</name>
  <type>
   <types>CatalogRef.ItemSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>StartUsing</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>EndOfUse</name>
  <type>
   <types>Date</types>
   <dateQualifiers>
    <dateFractions>Date</dateFractions>
   </dateQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ManagerSegment</name>
  <type>
   <types>CatalogRef.PartnerSegments</types>
  </type>
 </attributes>
 <attributes>
  <name>PriceIncludeTax</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>DaysBeforeDelivery</name>
  <type>
   <types>Number</types>
   <numberQualifiers>
    <precision>2</precision>
   </numberQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>Store</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </attributes>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.AgreementTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </attributes>
 <attributes>
  <name>ApArPostingDetail</name>
  <type>
   <types>EnumRef.ApArPostingDetail</types>
  </type>
 </attributes>
 <attributes>
  <name>StandardAgreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </attributes>
 <attributes>
  <name>Kind</name>
  <type>
   <types>EnumRef.AgreementKinds</types>
  </type>
 </attributes>
 <attributes>
  <name>UseCreditLimit</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>CreditLimitAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>PaymentTerm</name>
  <type>
   <types>CatalogRef.PaymentSchedules</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeType</name>
  <type>
   <types>EnumRef.TradeAgentFeeTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeePercent</name>
  <type>
   <types>DefinedType.typePercent</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeItem</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </attributes>
 <attributes>
  <name>TradeAgentFeeExpenseRevenueType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>RecordPurchasePrices</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Account</name>
  <type>
   <types>CatalogRef.PartnersBankAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>UseOrdersForSettlements</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Agreements/Forms/ChoiceForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	CatAgreementsServer.OnCreateAtServer(Cancel, StandardProcessing, ThisObject, Parameters);
	ThisObject.List.QueryText = LocalizationEvents.ReplaceDescriptionLocalizationPrefix(ThisObject.List.QueryText);
	CatalogsServer.OnCreateAtServerChoiceForm(ThisObject, List, Cancel, StandardProcessing);
	If Parameters.Property("FillingData") And Parameters.FillingData.Property("Company") Then
		_FilterCompany = Parameters.FillingData.Company;
		If ValueIsFilled(_FilterCompany) Then
			ThisObject.FilterCompany = _FilterCompany;
			ThisObject.FilterCompanyUse = True;
			SetCompanyFilter();
		EndIf;
	EndIf;
EndProcedure

&AtClient
Procedure ListBeforeAddRow(Item, Cancel, Clone, Parent, IsFolder, Parameter)
	CommonFormActions.DynamicListBeforeAddRow(ThisObject, Item, Cancel, Clone, Parent, IsFolder, Parameter, "Catalog.Agreements.ObjectForm");
EndProcedure

&AtClient
Procedure FilterCompanyOnChange(Item)
	SetCompanyFilter();
EndProcedure

&AtClient
Procedure FilterCompanyUseOnChange(Item)
	SetCompanyFilter()
EndProcedure

&AtServer
Procedure SetCompanyFilter()
	CommonFunctionsClientServer.SetFilterItem(List.Filter.Items, 
		"Company", 
		ThisObject.FilterCompany, 
		DataCompositionComparisonType.Equal, ThisObject.FilterCompanyUse);
EndProcedure

#Region COMMANDS

&AtClient
Procedure GeneratedFormCommandActionByName(Command) Export
	SelectedRows = Items.List.SelectedRows;
	ExternalCommandsClient.GeneratedListChoiceFormCommandActionByName(SelectedRows, ThisObject, Command.Name);
	GeneratedFormCommandActionByNameServer(Command.Name, SelectedRows);
EndProcedure

&AtServer
Procedure GeneratedFormCommandActionByNameServer(CommandName, SelectedRows) Export
	ExternalCommandsServer.GeneratedListChoiceFormCommandActionByName(SelectedRows, ThisObject, CommandName);
EndProcedure

&AtClient
Procedure InternalCommandAction(Command) Export
	InternalCommandsClient.RunCommandAction(Command, ThisObject, List, Items.List.SelectedRows);
EndProcedure

&AtClient
Procedure InternalCommandActionWithServerContext(Command) Export
	InternalCommandActionWithServerContextAtServer(Command.Name);
EndProcedure

&AtServer
Procedure InternalCommandActionWithServerContextAtServer(CommandName)
	InternalCommandsServer.RunCommandAction(CommandName, ThisObject, List, Items.List.SelectedRows);
EndProcedure

#EndRegion
